// Автогенерируемый файл. Не редактируйте вручную.
export const courseData = [
  {
    "id": "course_1",
    "originalTitle": "1. Kotlin полный курс - подготовка к собеседованию",
    "modules": [
      {
        "id": "mod_1_1",
        "title": "1. Введение",
        "lessons": [
          {
            "id": "less_1_1_1",
            "title": "1.1.1 Что такое программирование",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/1. Введение/1.1.1 Что такое программирование.mp4"
          },
          {
            "id": "less_1_1_2",
            "title": "1.1.2 Зачем нужны языки программирования",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/1. Введение/1.1.2 Зачем нужны языки программирования.mp4"
          }
        ]
      },
      {
        "id": "mod_1_2",
        "title": "2. Базовый синтаксис",
        "lessons": [
          {
            "id": "less_1_2_1",
            "title": "1.2.1 Скачиваем среду разработки",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.1 Скачиваем среду разработки.mp4"
          },
          {
            "id": "less_1_2_2",
            "title": "1.2.2 Первая программа",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.2 Первая программа.mp4"
          },
          {
            "id": "less_1_2_3",
            "title": "1.2.3 Чтение из консоли. Переменные",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.3 Чтение из консоли. Переменные.mp4"
          },
          {
            "id": "less_1_2_4",
            "title": "1.2.4 Спецсимволы и шаблоны",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.4 Спецсимволы и шаблоны.mp4"
          },
          {
            "id": "less_1_2_5",
            "title": "1.2.5 Целочисленный тип Int",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.5 Целочисленный тип Int.mp4"
          },
          {
            "id": "less_1_2_6",
            "title": "1.2.6 Целочисленное деление",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.6 Целочисленное деление.mp4"
          },
          {
            "id": "less_1_2_7",
            "title": "1.2.7 Условный оператор",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.7 Условный оператор.mp4"
          },
          {
            "id": "less_1_2_8",
            "title": "1.2.8 Условный оператор. Часть 2. Комбинирование",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.8 Условный оператор. Часть 2. Комбинирование.mp4"
          },
          {
            "id": "less_1_2_9",
            "title": "1.2.9 Изменяемые переменные",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.9 Изменяемые переменные.mp4"
          },
          {
            "id": "less_1_2_10",
            "title": "1.2.10 Дробные числа",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.10 Дробные числа.mp4"
          },
          {
            "id": "less_1_2_11",
            "title": "1.2.11 Введение в коллекции",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.11 Введение в коллекции.mp4"
          },
          {
            "id": "less_1_2_12",
            "title": "1.2.12 Циклы Repeat и While",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.12 Циклы Repeat и While.mp4"
          },
          {
            "id": "less_1_2_13",
            "title": "1.2.13 Цикл for и свойство size",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.13 Цикл for и свойство size.mp4"
          },
          {
            "id": "less_1_2_14",
            "title": "1.2.14 Диапазоны Ranges",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.14 Диапазоны Ranges.mp4"
          },
          {
            "id": "less_1_2_15",
            "title": "1.2.15 Целочисленные типы Long Short Byte",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.15 Целочисленные типы Long Short Byte.mp4"
          },
          {
            "id": "less_1_2_16",
            "title": "1.2.16 If and when are expressions",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.16 If and when are expressions.mp4"
          },
          {
            "id": "less_1_2_17",
            "title": "1.2.17 Символьный тип данных",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.17 Символьный тип данных.mp4"
          },
          {
            "id": "less_1_2_18",
            "title": "1.2.18 Do while и split",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/2. Базовый синтаксис/1.2.18 Do while и split.mp4"
          }
        ]
      },
      {
        "id": "mod_1_3",
        "title": "3. Объектно-ориентированное программирование",
        "lessons": [
          {
            "id": "less_1_3_1",
            "title": "1.3.1 Введение в ООП",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.1 Введение в ООП.mp4"
          },
          {
            "id": "less_1_3_2",
            "title": "1.3.2 Создание класса и объекта",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.2 Создание класса и объекта.mp4"
          },
          {
            "id": "less_1_3_3",
            "title": "1.3.3 Введение в функции",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.3 Введение в функции.mp4"
          },
          {
            "id": "less_1_3_4",
            "title": "1.3.4 Функции с параметрами",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.4 Функции с параметрами.mp4"
          },
          {
            "id": "less_1_3_5",
            "title": "1.3.5 Ключевое слово this и именованные параметры",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.5 Ключевое слово this и именованные параметры.mp4"
          },
          {
            "id": "less_1_3_6",
            "title": "1.3.6 Введение в конструкторы",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.6 Введение в конструкторы.mp4"
          },
          {
            "id": "less_1_3_7",
            "title": "1.3.7 Перегрузка конструкторов",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.7 Перегрузка конструкторов.mp4"
          },
          {
            "id": "less_1_3_8",
            "title": "1.3.8 Первичный конструктор",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.8 Первичный конструктор.mp4"
          },
          {
            "id": "less_1_3_9",
            "title": "1.3.9 Возвращаемый тип функций",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.9 Возвращаемый тип функций.mp4"
          },
          {
            "id": "less_1_3_10",
            "title": "1.3.10 Введение в наследование",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.10 Введение в наследование.mp4"
          },
          {
            "id": "less_1_3_11",
            "title": "1.3.11 Upcast, Downcast, Smartcast",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.11 Upcast, Downcast, Smartcast.mp4"
          },
          {
            "id": "less_1_3_12",
            "title": "1.3.12 Введение в полиморфизм",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.12 Введение в полиморфизм.mp4"
          },
          {
            "id": "less_1_3_13",
            "title": "1.3.13 Практика создание бухгалтера. Метод super",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.13 Практика создание бухгалтера. Метод super.mp4"
          },
          {
            "id": "less_1_3_14",
            "title": "1.3.14 Enum",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.14 Enum.mp4"
          },
          {
            "id": "less_1_3_15",
            "title": "1.3.15 Работа с файлами и мутабельными коллекциями",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.15 Работа с файлами и мутабельными коллекциями.mp4"
          },
          {
            "id": "less_1_3_16",
            "title": "1.3.16 Ручная сериализация и десериализация",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.16 Ручная сериализация и десериализация.mp4"
          },
          {
            "id": "less_1_3_17",
            "title": "1.3.17 Удаление элементов из списка",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.17 Удаление элементов из списка.mp4"
          },
          {
            "id": "less_1_3_18",
            "title": "1.3.18 Рефакторинг",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.18 Рефакторинг.mp4"
          },
          {
            "id": "less_1_3_19",
            "title": "1.3.19 Контрольная работа",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.19 Контрольная работа.mp4"
          },
          {
            "id": "less_1_3_20",
            "title": "1.3.20 Инкапсуляция и модификаторы доступа",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.20 Инкапсуляция и модификаторы доступа.mp4"
          },
          {
            "id": "less_1_3_21",
            "title": "1.3.21 Абстрактные классы",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.21 Абстрактные классы.mp4"
          },
          {
            "id": "less_1_3_22",
            "title": "1.3.22 Интерфейсы",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.22 Интерфейсы.mp4"
          },
          {
            "id": "less_1_3_23",
            "title": "1.3.23 Класс Any и метод toString",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.23 Класс Any и метод toString.mp4"
          },
          {
            "id": "less_1_3_24",
            "title": "1.3.24 Обзор ООП",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/3. Объектно-ориентированное программирование/1.3.24 Обзор ООП.mp4"
          }
        ]
      },
      {
        "id": "mod_1_4",
        "title": "4. Погружаемся в Kotlin",
        "lessons": [
          {
            "id": "less_1_4_1",
            "title": "1.4.1 Геттеры и сеттеры. Часть 1",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.1 Геттеры и сеттеры. Часть 1.mp4"
          },
          {
            "id": "less_1_4_2",
            "title": "1.4.2 Геттеры и сеттеры. Часть 2",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.2 Геттеры и сеттеры. Часть 2.mp4"
          },
          {
            "id": "less_1_4_3",
            "title": "1.4.3 Single Responsibility Principle",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.3 Single Responsibility Principle.mp4"
          },
          {
            "id": "less_1_4_4",
            "title": "1.4.4 Рефакторинг и StringBuilder",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.4 Рефакторинг и StringBuilder.mp4"
          },
          {
            "id": "less_1_4_5",
            "title": "1.4.5 Singleton Object",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.5 Singleton Object.mp4"
          },
          {
            "id": "less_1_4_6",
            "title": "1.4.6 Backing Field",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.6 Backing Field.mp4"
          },
          {
            "id": "less_1_4_7",
            "title": "1.4.7 Метод copy",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.7 Метод copy.mp4"
          },
          {
            "id": "less_1_4_8",
            "title": "1.4.8 Метод equals",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.8 Метод equals.mp4"
          },
          {
            "id": "less_1_4_9",
            "title": "1.4.9 Метод hashcode. Коллекции Set",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.9 Метод hashcode. Коллекции Set.mp4"
          },
          {
            "id": "less_1_4_10",
            "title": "1.4.10 Data Classes",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.10 Data Classes.mp4"
          },
          {
            "id": "less_1_4_11",
            "title": "1.4.11 Дополнение по методу copy",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.11 Дополнение по методу copy.mp4"
          },
          {
            "id": "less_1_4_12",
            "title": "1.4.12 Nullable Types",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.12 Nullable Types.mp4"
          },
          {
            "id": "less_1_4_13",
            "title": "1.4.13 Elvis и Unit",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.13 Elvis и Unit.mp4"
          },
          {
            "id": "less_1_4_14",
            "title": "1.4.14 Try catch",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.14 Try catch.mp4"
          },
          {
            "id": "less_1_4_15",
            "title": "1.4.15 Nothing",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/4. Погружаемся в Kotlin/1.4.15 Nothing.mp4"
          }
        ]
      },
      {
        "id": "mod_1_5",
        "title": "5. Функциональное программирование",
        "lessons": [
          {
            "id": "less_1_5_1",
            "title": "1.5.1 Kotlin Serialization",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.1 Kotlin Serialization.mp4"
          },
          {
            "id": "less_1_5_2",
            "title": "1.5.2 Получение тестовых данных",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.2 Получение тестовых данных.mp4"
          },
          {
            "id": "less_1_5_3",
            "title": "1.5.3 Чистые функции",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.3 Чистые функции.mp4"
          },
          {
            "id": "less_1_5_4",
            "title": "1.5.4 Анонимные классы",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.4 Анонимные классы.mp4"
          },
          {
            "id": "less_1_5_5",
            "title": "1.5.5 Лямбда выражения",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.5 Лямбда выражения.mp4"
          },
          {
            "id": "less_1_5_6",
            "title": "1.5.6 Введение в Generics",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.6 Введение в Generics.mp4"
          },
          {
            "id": "less_1_5_7",
            "title": "1.5.7 Extension functions",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.7 Extension functions.mp4"
          },
          {
            "id": "less_1_5_8",
            "title": "1.5.8 Inline functions",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.8 Inline functions.mp4"
          },
          {
            "id": "less_1_5_9",
            "title": "1.5.9 Примеры функций высшего порядка",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.9 Примеры функций высшего порядка.mp4"
          },
          {
            "id": "less_1_5_10",
            "title": "1.5.10 Функция Let",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.10 Функция Let.mp4"
          },
          {
            "id": "less_1_5_11",
            "title": "1.5.11 Функция Also",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.11 Функция Also.mp4"
          },
          {
            "id": "less_1_5_12",
            "title": "1.5.12 Коллекции Map",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.12 Коллекции Map.mp4"
          },
          {
            "id": "less_1_5_13",
            "title": "1.5.13 Map для улучшения производительности",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.13 Map для улучшения производительности.mp4"
          },
          {
            "id": "less_1_5_14",
            "title": "1.5.14 Функции With и Apply",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.14 Функции With и Apply.mp4"
          },
          {
            "id": "less_1_5_15",
            "title": "1.5.15 Функция Run и Method reference",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/5. Функциональное программирование/1.5.15 Функция Run и Method reference.mp4"
          }
        ]
      },
      {
        "id": "mod_1_6",
        "title": "6. Паттерны проектирования",
        "lessons": [
          {
            "id": "less_1_6_1",
            "title": "1.6.1 Основы многопоточности",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.1 Основы многопоточности.mp4"
          },
          {
            "id": "less_1_6_2",
            "title": "1.6.2 Singleton. Companion. Init",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.2 Singleton. Companion. Init.mp4"
          },
          {
            "id": "less_1_6_3",
            "title": "1.6.3 Singleton. Способы реализации",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.3 Singleton. Способы реализации.mp4"
          },
          {
            "id": "less_1_6_4",
            "title": "1.6.4 Singleton. Синхронизация",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.4 Singleton. Синхронизация.mp4"
          },
          {
            "id": "less_1_6_5",
            "title": "1.6.5 Создание GUI",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.5 Создание GUI.mp4"
          },
          {
            "id": "less_1_6_6",
            "title": "1.6.6 Observer. Введение",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.6 Observer. Введение.mp4"
          },
          {
            "id": "less_1_6_7",
            "title": "1.6.7 Observer. Зависимость от абстракций",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.7 Observer. Зависимость от абстракций.mp4"
          },
          {
            "id": "less_1_6_8",
            "title": "1.6.8 Observer. Функциональный интерфейс",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.8 Observer. Функциональный интерфейс.mp4"
          },
          {
            "id": "less_1_6_9",
            "title": "1.6.9 Observer. Интерфейс Observable",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.9 Observer. Интерфейс Observable.mp4"
          },
          {
            "id": "less_1_6_10",
            "title": "1.6.10 Observer. MutableObservable",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.10 Observer. MutableObservable.mp4"
          },
          {
            "id": "less_1_6_11",
            "title": "1.6.11 Observer. Backing field и итоги",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.11 Observer. Backing field и итоги.mp4"
          },
          {
            "id": "less_1_6_12",
            "title": "1.6.12 Command и BlockingQueue",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.12 Command и BlockingQueue.mp4"
          },
          {
            "id": "less_1_6_13",
            "title": "1.6.13 Sealed Interface",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.13 Sealed Interface.mp4"
          },
          {
            "id": "less_1_6_14",
            "title": "1.6.14 Builder",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/6. Паттерны проектирования/1.6.14 Builder.mp4"
          }
        ]
      },
      {
        "id": "mod_1_7",
        "title": "7. Устройство коллекций",
        "lessons": [
          {
            "id": "less_1_7_1",
            "title": "1.7.1 Junit часть 1",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.1 Junit часть 1.mp4"
          },
          {
            "id": "less_1_7_2",
            "title": "1.7.2 Junit часть 2. Parameterized Test",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.2 Junit часть 2. Parameterized Test.mp4"
          },
          {
            "id": "less_1_7_3",
            "title": "1.7.3 Массивы",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.3 Массивы.mp4"
          },
          {
            "id": "less_1_7_4",
            "title": "1.7.4 ArrayList. Часть 1",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.4 ArrayList. Часть 1.mp4"
          },
          {
            "id": "less_1_7_5",
            "title": "1.7.5 ArrayList. Часть 2",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.5 ArrayList. Часть 2.mp4"
          },
          {
            "id": "less_1_7_6",
            "title": "1.7.6 ArrayList. Часть 3. Константы и операторы",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.6 ArrayList. Часть 3. Константы и операторы.mp4"
          },
          {
            "id": "less_1_7_7",
            "title": "1.7.7 Алгоритмическая сложность",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.7 Алгоритмическая сложность.mp4"
          },
          {
            "id": "less_1_7_8",
            "title": "1.7.8 Тестирование исключений. System.arraycopy",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.8 Тестирование исключений. System.arraycopy.mp4"
          },
          {
            "id": "less_1_7_9",
            "title": "1.7.9 LinkedList. Принцип работы",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.9 LinkedList. Принцип работы.mp4"
          },
          {
            "id": "less_1_7_10",
            "title": "1.7.10 LinkedList. Реализация",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.10 LinkedList. Реализация.mp4"
          },
          {
            "id": "less_1_7_11",
            "title": "1.7.11 LinkedList. Двусвязный список",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.11 LinkedList. Двусвязный список.mp4"
          },
          {
            "id": "less_1_7_12",
            "title": "1.7.12 HashSet. Принцип работы",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.12 HashSet. Принцип работы.mp4"
          },
          {
            "id": "less_1_7_13",
            "title": "1.7.13 HashSet. Реализация. Часть",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.13 HashSet. Реализация. Часть.mp4"
          },
          {
            "id": "less_1_7_14",
            "title": "1.7.14 HashSet. Реализация. Часть 2",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.14 HashSet. Реализация. Часть 2.mp4"
          },
          {
            "id": "less_1_7_15",
            "title": "1.7.15 HashSet. Вопросы на собеседовании",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.15 HashSet. Вопросы на собеседовании.mp4"
          },
          {
            "id": "less_1_7_16",
            "title": "1.7.16 Параметризируем коллекции",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.16 Параметризируем коллекции.mp4"
          },
          {
            "id": "less_1_7_17",
            "title": "1.7.17 Collections и Iterable",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.17 Collections и Iterable.mp4"
          },
          {
            "id": "less_1_7_18",
            "title": "1.7.18 MutableIterable",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.18 MutableIterable.mp4"
          },
          {
            "id": "less_1_7_19",
            "title": "1.7.19 Реализации Set",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.19 Реализации Set.mp4"
          },
          {
            "id": "less_1_7_20",
            "title": "1.7.20 Устройство TreeSet",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.20 Устройство TreeSet.mp4"
          },
          {
            "id": "less_1_7_21",
            "title": "1.7.21 Неизменяемые коллекции",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.21 Неизменяемые коллекции.mp4"
          },
          {
            "id": "less_1_7_22",
            "title": "1.7.22 Коллекции Map",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.22 Коллекции Map.mp4"
          },
          {
            "id": "less_1_7_23",
            "title": "1.7.23 Использование Map внутри Set",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.23 Использование Map внутри Set.mp4"
          },
          {
            "id": "less_1_7_24",
            "title": "1.7.24 Собеседование по теме коллекции",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/7. Устройство коллекций/1.7.24 Собеседование по теме коллекции.mp4"
          }
        ]
      },
      {
        "id": "mod_1_8",
        "title": "8. Асинхронность и многопоточность",
        "lessons": [
          {
            "id": "less_1_8_1",
            "title": "1.8.1 Создание GUI",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.1 Создание GUI.mp4"
          },
          {
            "id": "less_1_8_2",
            "title": "1.8.2 Добавление логики и метод String.format",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.2 Добавление логики и метод String.format.mp4"
          },
          {
            "id": "less_1_8_3",
            "title": "1.8.3 Механизм callbac",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.3 Механизм callbac.mp4"
          },
          {
            "id": "less_1_8_4",
            "title": "1.8.4 Suspend функции",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.4 Suspend функции.mp4"
          },
          {
            "id": "less_1_8_5",
            "title": "1.8.5 Корутины под капотом",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.5 Корутины под капотом.mp4"
          },
          {
            "id": "less_1_8_6",
            "title": "1.8.6 Executor Services",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.6 Executor Services.mp4"
          },
          {
            "id": "less_1_8_7",
            "title": "1.8.7 Structured Concurrency. Часть 1",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.7 Structured Concurrency. Часть 1.mp4"
          },
          {
            "id": "less_1_8_8",
            "title": "1.8.8 Dispatchers Default и Unconfined",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.8 Dispatchers Default и Unconfined.mp4"
          },
          {
            "id": "less_1_8_9",
            "title": "1.8.9 Dispatchers IO и Main",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.9 Dispatchers IO и Main.mp4"
          },
          {
            "id": "less_1_8_10",
            "title": "1.8.10 Job и параллельность",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.10 Job и параллельность.mp4"
          },
          {
            "id": "less_1_8_11",
            "title": "1.8.11 Async и Deferred",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.11 Async и Deferred.mp4"
          },
          {
            "id": "less_1_8_12",
            "title": "1.8.12 Jobs Hierarchy",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.12 Jobs Hierarchy.mp4"
          },
          {
            "id": "less_1_8_13",
            "title": "1.8.13 Исключения. Часть 1",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.13 Исключения. Часть 1.mp4"
          },
          {
            "id": "less_1_8_14",
            "title": "1.8.14 Исключения. Часть 2. Async",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.14 Исключения. Часть 2. Async.mp4"
          },
          {
            "id": "less_1_8_15",
            "title": "1.8.15 Отмена корутин",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.15 Отмена корутин.mp4"
          },
          {
            "id": "less_1_8_16",
            "title": "1.8.16 Suspend Coroutine",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.16 Suspend Coroutine.mp4"
          },
          {
            "id": "less_1_8_17",
            "title": "1.8.17 SupervisorJob",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.17 SupervisorJob.mp4"
          },
          {
            "id": "less_1_8_18",
            "title": "1.8.18 Что такое потоки данных",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.18 Что такое потоки данных.mp4"
          },
          {
            "id": "less_1_8_19",
            "title": "1.8.19 Способы создания Sequence",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.19 Способы создания Sequence.mp4"
          },
          {
            "id": "less_1_8_20",
            "title": "1.8.20 Начало работы с Flow",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.20 Начало работы с Flow.mp4"
          },
          {
            "id": "less_1_8_21",
            "title": "1.8.21 Знакомство с API",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.21 Знакомство с API.mp4"
          },
          {
            "id": "less_1_8_22",
            "title": "1.8.22 Загрузка данных из сети",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.22 Загрузка данных из сети.mp4"
          },
          {
            "id": "less_1_8_23",
            "title": "1.8.23 Создание GUI и работа с Regex",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.23 Создание GUI и работа с Regex.mp4"
          },
          {
            "id": "less_1_8_24",
            "title": "1.8.24 Реактивный стиль",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.24 Реактивный стиль.mp4"
          },
          {
            "id": "less_1_8_25",
            "title": "1.8.25 Channels и Debounce",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.25 Channels и Debounce.mp4"
          },
          {
            "id": "less_1_8_26",
            "title": "1.8.26 Холодные потоки данных",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.26 Холодные потоки данных.mp4"
          },
          {
            "id": "less_1_8_27",
            "title": "1.8.27 Горячие потоки данных",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.27 Горячие потоки данных.mp4"
          },
          {
            "id": "less_1_8_28",
            "title": "1.8.28 ShareIn",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.28 ShareIn.mp4"
          },
          {
            "id": "less_1_8_29",
            "title": "1.8.29 Buffer и Backpressure",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.29 Buffer и Backpressure.mp4"
          },
          {
            "id": "less_1_8_30",
            "title": "1.8.30 Screen state as Flow",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.30 Screen state as Flow.mp4"
          },
          {
            "id": "less_1_8_31",
            "title": "1.8.31 MutableStateFlow",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.31 MutableStateFlow.mp4"
          },
          {
            "id": "less_1_8_32",
            "title": "1.8.32 SharedFlow vs StateFlow",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.32 SharedFlow vs StateFlow.mp4"
          },
          {
            "id": "less_1_8_33",
            "title": "1.8.33 Exceptions in Flow",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.33 Exceptions in Flow.mp4"
          },
          {
            "id": "less_1_8_34",
            "title": "1.8.34 Практика работы с исключениями",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.34 Практика работы с исключениями.mp4"
          },
          {
            "id": "less_1_8_35",
            "title": "1.8.35 Оператор FlowOn",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.35 Оператор FlowOn.mp4"
          },
          {
            "id": "less_1_8_36",
            "title": "1.8.36 Наследование CoroutineScope",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.36 Наследование CoroutineScope.mp4"
          },
          {
            "id": "less_1_8_37",
            "title": "1.8.37 Синхронизация корутин",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.37 Синхронизация корутин.mp4"
          },
          {
            "id": "less_1_8_38",
            "title": "1.8.38 Channel",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/8. Асинхронность и многопоточность/1.8.38 Channel.mp4"
          }
        ]
      },
      {
        "id": "mod_1_9",
        "title": "9. Kotlin в деталях",
        "lessons": [
          {
            "id": "less_1_9_1",
            "title": "1.9.1 Инвариантность и Ковариантность",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.1 Инвариантность и Ковариантность.mp4"
          },
          {
            "id": "less_1_9_2",
            "title": "1.9.2 Контрвариантность",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.2 Контрвариантность.mp4"
          },
          {
            "id": "less_1_9_3",
            "title": "1.9.3 Стирание типов",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.3 Стирание типов.mp4"
          },
          {
            "id": "less_1_9_4",
            "title": "1.9.4 Reified и Star Projection",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.4 Reified и Star Projection.mp4"
          },
          {
            "id": "less_1_9_5",
            "title": "1.9.5 Inline и Non local return",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.5 Inline и Non local return.mp4"
          },
          {
            "id": "less_1_9_6",
            "title": "1.9.6 Crossinline и noinline",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.6 Crossinline и noinline.mp4"
          },
          {
            "id": "less_1_9_7",
            "title": "1.9.7 Value classes",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.7 Value classes.mp4"
          },
          {
            "id": "less_1_9_8",
            "title": "1.9.8 Делегирование свойств",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.8 Делегирование свойств.mp4"
          },
          {
            "id": "less_1_9_9",
            "title": "1.9.9 Делегирование реализации интерфейсов",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.9 Делегирование реализации интерфейсов.mp4"
          },
          {
            "id": "less_1_9_10",
            "title": "1.9.10 Inner и Nested классы",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.10 Inner и Nested классы.mp4"
          },
          {
            "id": "less_1_9_11",
            "title": "1.9.11 Destructuring declaration and Infix",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.11 Destructuring declaration and Infix.mp4"
          },
          {
            "id": "less_1_9_12",
            "title": "1.9.12 Устройство памяти в Kotlin",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.12 Устройство памяти в Kotlin.mp4"
          },
          {
            "id": "less_1_9_13",
            "title": "1.9.13 Как работают программы на Java и Kotlin",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.13 Как работают программы на Java и Kotlin.mp4"
          },
          {
            "id": "less_1_9_14",
            "title": "1.9.14 Модификатор Internal",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.14 Модификатор Internal.mp4"
          },
          {
            "id": "less_1_9_15",
            "title": "1.9.15 Собеседование",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.15 Собеседование.mp4"
          },
          {
            "id": "less_1_9_16",
            "title": "1.9.18 Финал",
            "url": "/courses/1. Kotlin полный курс - подготовка к собеседованию/9. Kotlin в деталях/1.9.18 Финал.mp4"
          }
        ]
      }
    ]
  },
  {
    "id": "course_2",
    "originalTitle": "2. Современная Android-разработка базовый курс",
    "modules": [
      {
        "id": "mod_2_1",
        "title": "1. Введение",
        "lessons": [
          {
            "id": "less_2_1_1",
            "title": "2.1.1 Установка среды разработки видео для курса Современная Android",
            "url": "/courses/2. Современная Android-разработка базовый курс/1. Введение/2.1.1 Установка среды разработки видео для курса Современная Android.mp4"
          },
          {
            "id": "less_2_1_2",
            "title": "2.1.2 Знакомство с Android Studio",
            "url": "/courses/2. Современная Android-разработка базовый курс/1. Введение/2.1.2 Знакомство с Android Studio.mp4"
          },
          {
            "id": "less_2_1_3",
            "title": "2.1.3 Разбор первой программы. Dp и Sp",
            "url": "/courses/2. Современная Android-разработка базовый курс/1. Введение/2.1.3 Разбор первой программы. Dp и Sp.mp4"
          },
          {
            "id": "less_2_1_4",
            "title": "2.1.4 Modifier",
            "url": "/courses/2. Современная Android-разработка базовый курс/1. Введение/2.1.4 Modifier.mp4"
          },
          {
            "id": "less_2_1_5",
            "title": "2.1.5 Row Column Alignment",
            "url": "/courses/2. Современная Android-разработка базовый курс/1. Введение/2.1.5 Row Column Alignment.mp4"
          },
          {
            "id": "less_2_1_6",
            "title": "2.1.6 Combining Containers",
            "url": "/courses/2. Современная Android-разработка базовый курс/1. Введение/2.1.6 Combining Containers.mp4"
          },
          {
            "id": "less_2_1_7",
            "title": "2.1.7 ARGB модель",
            "url": "/courses/2. Современная Android-разработка базовый курс/1. Введение/2.1.7 ARGB модель.mp4"
          },
          {
            "id": "less_2_1_8",
            "title": "2.1.8 Scaffold и Custom Components",
            "url": "/courses/2. Современная Android-разработка базовый курс/1. Введение/2.1.8 Scaffold и Custom Components.mp4"
          },
          {
            "id": "less_2_1_9",
            "title": "2.1.9 Material Theme",
            "url": "/courses/2. Современная Android-разработка базовый курс/1. Введение/2.1.9 Material Theme.mp4"
          },
          {
            "id": "less_2_1_10",
            "title": "2.1.10 Preview и итоги раздела",
            "url": "/courses/2. Современная Android-разработка базовый курс/1. Введение/2.1.10 Preview и итоги раздела.mp4"
          }
        ]
      },
      {
        "id": "mod_2_2",
        "title": "2. Создаём калькулятор",
        "lessons": [
          {
            "id": "less_2_2_1",
            "title": "2.2.1 Создаём тему для калькулятора",
            "url": "/courses/2. Современная Android-разработка базовый курс/2. Создаём калькулятор/2.2.1 Создаём тему для калькулятора.mp4"
          },
          {
            "id": "less_2_2_2",
            "title": "2.2.2 Создание каркаса приложения √ π ^ !",
            "url": "/courses/2. Современная Android-разработка базовый курс/2. Создаём калькулятор/2.2.2 Создание каркаса приложения √ π ^ !.mp4"
          },
          {
            "id": "less_2_2_3",
            "title": "2.2.3 Clip. Дорабатываем UI",
            "url": "/courses/2. Современная Android-разработка базовый курс/2. Создаём калькулятор/2.2.3 Clip. Дорабатываем UI.mp4"
          },
          {
            "id": "less_2_2_4",
            "title": "2.2.4 State Рекомпозиции и Логи",
            "url": "/courses/2. Современная Android-разработка базовый курс/2. Создаём калькулятор/2.2.4 State Рекомпозиции и Логи.mp4"
          },
          {
            "id": "less_2_2_5",
            "title": "2.2.5 View и ViewModel",
            "url": "/courses/2. Современная Android-разработка базовый курс/2. Создаём калькулятор/2.2.5 View и ViewModel.mp4"
          },
          {
            "id": "less_2_2_6",
            "title": "2.2.6 Использование паттерна Команда",
            "url": "/courses/2. Современная Android-разработка базовый курс/2. Создаём калькулятор/2.2.6 Использование паттерна Команда.mp4"
          },
          {
            "id": "less_2_2_7",
            "title": "2.2.7 StateFlow и ViewModel",
            "url": "/courses/2. Современная Android-разработка базовый курс/2. Создаём калькулятор/2.2.7 StateFlow и ViewModel.mp4"
          },
          {
            "id": "less_2_2_8",
            "title": "2.2.8 Добавляем стейты экрана",
            "url": "/courses/2. Современная Android-разработка базовый курс/2. Создаём калькулятор/2.2.8 Добавляем стейты экрана.mp4"
          },
          {
            "id": "less_2_2_9",
            "title": "2.2.9 Форматирование выражения",
            "url": "/courses/2. Современная Android-разработка базовый курс/2. Создаём калькулятор/2.2.9 Форматирование выражения.mp4"
          },
          {
            "id": "less_2_2_10",
            "title": "2.2.10 Завершение работы над калькулятором",
            "url": "/courses/2. Современная Android-разработка базовый курс/2. Создаём калькулятор/2.2.10 Завершение работы над калькулятором.mp4"
          }
        ]
      },
      {
        "id": "mod_2_3",
        "title": "3. Приложение NotePad",
        "lessons": [
          {
            "id": "less_2_3_1",
            "title": "2.3.1 Введение в Clean Architecture",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.1 Введение в Clean Architecture.mp4"
          },
          {
            "id": "less_2_3_2",
            "title": "2.3.2 Domain слой. Часть 1",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.2 Domain слой. Часть 1.mp4"
          },
          {
            "id": "less_2_3_3",
            "title": "2.3.3 Domain слой. Часть 2",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.3 Domain слой. Часть 2.mp4"
          },
          {
            "id": "less_2_3_4",
            "title": "2.3.4 Тестовый Репозиторий",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.4 Тестовый Репозиторий.mp4"
          },
          {
            "id": "less_2_3_5",
            "title": "2.3.5 NotesViewModel. FlatMapLatest",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.5 NotesViewModel. FlatMapLatest.mp4"
          },
          {
            "id": "less_2_3_6",
            "title": "2.3.6 Подготовка к созданию UI",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.6 Подготовка к созданию UI.mp4"
          },
          {
            "id": "less_2_3_7",
            "title": "2.3.7 RememberScrollState",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.7 RememberScrollState.mp4"
          },
          {
            "id": "less_2_3_8",
            "title": "2.3.8 LazyLists",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.8 LazyLists.mp4"
          },
          {
            "id": "less_2_3_9",
            "title": "2.3.9 Key и настройка темы",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.9 Key и настройка темы.mp4"
          },
          {
            "id": "less_2_3_10",
            "title": "2.3.10 NotesScreen UI. Часть 1",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.10 NotesScreen UI. Часть 1.mp4"
          },
          {
            "id": "less_2_3_11",
            "title": "2.3.11 NotesScreen UI. Часть 2",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.11 NotesScreen UI. Часть 2.mp4"
          },
          {
            "id": "less_2_3_12",
            "title": "2.3.12 ViewModelScope",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.12 ViewModelScope.mp4"
          },
          {
            "id": "less_2_3_13",
            "title": "2.3.13 Форматирование даты",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.13 Форматирование даты.mp4"
          },
          {
            "id": "less_2_3_14",
            "title": "2.3.14 NotesScreen UI. Часть 3",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.14 NotesScreen UI. Часть 3.mp4"
          },
          {
            "id": "less_2_3_15",
            "title": "2.3.15 CreateNoteViewModel",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.15 CreateNoteViewModel.mp4"
          },
          {
            "id": "less_2_3_16",
            "title": "2.3.16 CreateNoteScreen",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.16 CreateNoteScreen.mp4"
          },
          {
            "id": "less_2_3_17",
            "title": "2.3.17 SideEffects",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.17 SideEffects.mp4"
          },
          {
            "id": "less_2_3_18",
            "title": "2.3.18 EditNoteScreen",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.18 EditNoteScreen.mp4"
          },
          {
            "id": "less_2_3_19",
            "title": "2.3.19 Кастомная навигация",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.19 Кастомная навигация.mp4"
          },
          {
            "id": "less_2_3_20",
            "title": "2.3.20 Jetpack Compose Navigation",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.20 Jetpack Compose Navigation.mp4"
          },
          {
            "id": "less_2_3_21",
            "title": "2.3.21 Передача параметров в навигации",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.21 Передача параметров в навигации.mp4"
          },
          {
            "id": "less_2_3_22",
            "title": "2.3.22 Введение в базы данных",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.22 Введение в базы данных.mp4"
          },
          {
            "id": "less_2_3_23",
            "title": "2.3.23 Mapper и Entity",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.23 Mapper и Entity.mp4"
          },
          {
            "id": "less_2_3_24",
            "title": "2.3.24 SQL. Создание DAO",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.24 SQL. Создание DAO.mp4"
          },
          {
            "id": "less_2_3_25",
            "title": "2.3.25 Context",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.25 Context.mp4"
          },
          {
            "id": "less_2_3_26",
            "title": "2.3.26 Создание базы данных",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.26 Создание базы данных.mp4"
          },
          {
            "id": "less_2_3_27",
            "title": "2.3.27 NotesRepositoryImpl",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.27 NotesRepositoryImpl.mp4"
          },
          {
            "id": "less_2_3_28",
            "title": "2.3.28 Использование нового репозитория",
            "url": "/courses/2. Современная Android-разработка базовый курс/3. Приложение NotePad/2.3.28 Использование нового репозитория.mp4"
          }
        ]
      },
      {
        "id": "mod_2_4",
        "title": "4. Dependency Injection в Android",
        "lessons": [
          {
            "id": "less_2_4_1",
            "title": "2.4.1 Dependency Injection. Введение",
            "url": "/courses/2. Современная Android-разработка базовый курс/4. Dependency Injection в Android/2.4.1 Dependency Injection. Введение.mp4"
          },
          {
            "id": "less_2_4_2",
            "title": "2.4.2 Компонент. Инъекция в свойства класса",
            "url": "/courses/2. Современная Android-разработка базовый курс/4. Dependency Injection в Android/2.4.2 Компонент. Инъекция в свойства класса.mp4"
          },
          {
            "id": "less_2_4_3",
            "title": "2.4.3 Жизненный цикл зависимостей",
            "url": "/courses/2. Современная Android-разработка базовый курс/4. Dependency Injection в Android/2.4.3 Жизненный цикл зависимостей.mp4"
          },
          {
            "id": "less_2_4_4",
            "title": "2.4.4 Подключение Hilt",
            "url": "/courses/2. Современная Android-разработка базовый курс/4. Dependency Injection в Android/2.4.4 Подключение Hilt.mp4"
          },
          {
            "id": "less_2_4_5",
            "title": "2.4.5 Module Provides Singleton",
            "url": "/courses/2. Современная Android-разработка базовый курс/4. Dependency Injection в Android/2.4.5 Module Provides Singleton.mp4"
          },
          {
            "id": "less_2_4_6",
            "title": "2.4.6 Binds",
            "url": "/courses/2. Современная Android-разработка базовый курс/4. Dependency Injection в Android/2.4.6 Binds.mp4"
          },
          {
            "id": "less_2_4_7",
            "title": "2.4.7 Assisted Inject",
            "url": "/courses/2. Современная Android-разработка базовый курс/4. Dependency Injection в Android/2.4.7 Assisted Inject.mp4"
          },
          {
            "id": "less_2_4_8",
            "title": "2.4.8 Hilt Navigation Compose",
            "url": "/courses/2. Современная Android-разработка базовый курс/4. Dependency Injection в Android/2.4.8 Hilt Navigation Compose.mp4"
          },
          {
            "id": "less_2_4_9",
            "title": "2.4.9 Практика. Добавление Hilt в приложение Notes",
            "url": "/courses/2. Современная Android-разработка базовый курс/4. Dependency Injection в Android/2.4.9 Практика. Добавление Hilt в приложение Notes.mp4"
          },
          {
            "id": "less_2_4_10",
            "title": "2.4.10 FAQ и подведение итогов",
            "url": "/courses/2. Современная Android-разработка базовый курс/4. Dependency Injection в Android/2.4.10 FAQ и подведение итогов.mp4"
          }
        ]
      },
      {
        "id": "mod_2_5",
        "title": "5. Организация локального хранения данных",
        "lessons": [
          {
            "id": "less_2_5_1",
            "title": "2.5.1 Сериализация контента",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.1 Сериализация контента.mp4"
          },
          {
            "id": "less_2_5_2",
            "title": "2.5.2 Подготовка к работе с изображениями",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.2 Подготовка к работе с изображениями.mp4"
          },
          {
            "id": "less_2_5_3",
            "title": "2.5.3 ActivityResultApi",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.3 ActivityResultApi.mp4"
          },
          {
            "id": "less_2_5_4",
            "title": "2.5.4 Сохранение изображений",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.4 Сохранение изображений.mp4"
          },
          {
            "id": "less_2_5_5",
            "title": "2.5.5 Coil и группировка изображений",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.5 Coil и группировка изображений.mp4"
          },
          {
            "id": "less_2_5_6",
            "title": "2.5.6 Практика. Экран редактирования заметки",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.6 Практика. Экран редактирования заметки.mp4"
          },
          {
            "id": "less_2_5_7",
            "title": "2.5.7 External и Internal Storage",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.7 External и Internal Storage.mp4"
          },
          {
            "id": "less_2_5_8",
            "title": "2.5.8 Работа с Internal Storage",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.8 Работа с Internal Storage.mp4"
          },
          {
            "id": "less_2_5_9",
            "title": "2.5.9 Отображение картинок на главной",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.9 Отображение картинок на главной.mp4"
          },
          {
            "id": "less_2_5_10",
            "title": "2.5.10 Градиенты и строковые ресурсы",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.10 Градиенты и строковые ресурсы.mp4"
          },
          {
            "id": "less_2_5_11",
            "title": "2.5.11 Splash Screen Api",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.11 Splash Screen Api.mp4"
          },
          {
            "id": "less_2_5_12",
            "title": "2.5.12 Нормализация БД",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.12 Нормализация БД.mp4"
          },
          {
            "id": "less_2_5_13",
            "title": "2.5.13 Embedded Relation Join",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.13 Embedded Relation Join.mp4"
          },
          {
            "id": "less_2_5_14",
            "title": "2.5.14 Поддержка новой схемы БД",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.14 Поддержка новой схемы БД.mp4"
          },
          {
            "id": "less_2_5_15",
            "title": "2.5.15 Транзакции и Итоги",
            "url": "/courses/2. Современная Android-разработка базовый курс/5. Организация локального хранения данных/2.5.15 Транзакции и Итоги.mp4"
          }
        ]
      },
      {
        "id": "mod_2_6",
        "title": "6.  Работа с сетью в Android",
        "lessons": [
          {
            "id": "less_2_6_1",
            "title": "2.6.1 Демонстрация приложения News",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.1 Демонстрация приложения News.mp4"
          },
          {
            "id": "less_2_6_2",
            "title": "2.6.2 Добавление зависимостей",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.2 Добавление зависимостей.mp4"
          },
          {
            "id": "less_2_6_3",
            "title": "2.6.3 Domain слой и Database",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.3 Domain слой и Database.mp4"
          },
          {
            "id": "less_2_6_4",
            "title": "2.6.4 Index Room",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.4 Index Room.mp4"
          },
          {
            "id": "less_2_6_5",
            "title": "2.6.5 Знакомство с API",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.5 Знакомство с API.mp4"
          },
          {
            "id": "less_2_6_6",
            "title": "2.6.6 Retrofit",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.6 Retrofit.mp4"
          },
          {
            "id": "less_2_6_7",
            "title": "2.6.7 Реализация Репозитория",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.7 Реализация Репозитория.mp4"
          },
          {
            "id": "less_2_6_8",
            "title": "2.6.8 SubscriptionsViewModel",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.8 SubscriptionsViewModel.mp4"
          },
          {
            "id": "less_2_6_9",
            "title": "2.6.9 SubscriptionsScreen",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.9 SubscriptionsScreen.mp4"
          },
          {
            "id": "less_2_6_10",
            "title": "2.6.10 SubscriptionsScreen Часть 2",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.10 SubscriptionsScreen Часть 2.mp4"
          },
          {
            "id": "less_2_6_11",
            "title": "2.6.11 Явные и неявные интенты",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.11 Явные и неявные интенты.mp4"
          },
          {
            "id": "less_2_6_12",
            "title": "2.6.12 Компоненты Android",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.12 Компоненты Android.mp4"
          },
          {
            "id": "less_2_6_13",
            "title": "2.6.13 WorkManager",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.13 WorkManager.mp4"
          },
          {
            "id": "less_2_6_14",
            "title": "2.6.14 Hilt with Workers",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.14 Hilt with Workers.mp4"
          },
          {
            "id": "less_2_6_15",
            "title": "2.6.15 Domain Settings",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.15 Domain Settings.mp4"
          },
          {
            "id": "less_2_6_16",
            "title": "2.6.16 Data Store",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.16 Data Store.mp4"
          },
          {
            "id": "less_2_6_17",
            "title": "2.6.17 Annotation param и Merged Manifests",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.17 Annotation param и Merged Manifests.mp4"
          },
          {
            "id": "less_2_6_18",
            "title": "2.6.18 Constraints",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.18 Constraints.mp4"
          },
          {
            "id": "less_2_6_19",
            "title": "2.6.19 AppStartupManager",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.19 AppStartupManager.mp4"
          },
          {
            "id": "less_2_6_20",
            "title": "2.6.20 Notifications",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.20 Notifications.mp4"
          },
          {
            "id": "less_2_6_21",
            "title": "2.6.21 Pending Intent",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.21 Pending Intent.mp4"
          },
          {
            "id": "less_2_6_22",
            "title": "2.6.22 Применение настроек для загрузки",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.22 Применение настроек для загрузки.mp4"
          },
          {
            "id": "less_2_6_23",
            "title": "2.6.23 BuildConfig",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.23 BuildConfig.mp4"
          },
          {
            "id": "less_2_6_24",
            "title": "2.6.24 SettingsViewModel",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.24 SettingsViewModel.mp4"
          },
          {
            "id": "less_2_6_25",
            "title": "2.6.25 SettingsScreen",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.25 SettingsScreen.mp4"
          },
          {
            "id": "less_2_6_26",
            "title": "2.6.26 Навигация",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.26 Навигация.mp4"
          },
          {
            "id": "less_2_6_27",
            "title": "2.6.29 Финал",
            "url": "/courses/2. Современная Android-разработка базовый курс/6.  Работа с сетью в Android/2.6.29 Финал.mp4"
          }
        ]
      }
    ]
  }
];
